[
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "8",
        "Title": "Courts to try all civil suits unless barred.",
        "Content": "The Courts shall (subject to the provisions herein contained) have jurisdiction to try all suits of a civil nature excepting suits of which their cognizance is either expressly or impliedly barred Explanation . A suit in which the right to property or to an office is contested is a suit of a civil nature, notwithstanding that such right may depend entirely on the decision of questions as to religious rites or ceremonies.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "9",
        "Title": "Stay of suit.",
        "Content": "No Court shall proceed with the trial of any suit in which the matter in issue is also directly and substantially in issue in a previously instituted suit between the same parties, or between parties under whom they or any of them claim litigating under the same title where such suit is pending in the same or any other Court in 1[Pakistan] having jurisdiction to grant the relief claimed, or in any Court beyond the limits of 1[Pakistan] established or continued by 2[the 3[Federal Government] 4* * *] and having like jurisdiction, or before 5[the Supreme Court]. Explanation. The pendency of a suit in a foreign Court does not preclude the Courts in 1[Pakistan] from trying a suit founded on the same cause of action.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "10",
        "Title": "Res Judicata .",
        "Content": "No Court shall try suit or issue in which the matter directly and substantially in issue has been directly and substantially in issue in a former suit between the same parties, or between parties under whom they or any of them claim, litigating under the same title, in a Court competent to try such subsequent suit or the suit in which such issue has been subsequently raised, and has been heard and finally decided by such Court. Explanation I . The expression \"former suit\" shall denote a suit which has been decided prior to the suit in question whether or not it was instituted prior thereto. Explanation II. For the purposes of this section, the competence of a Court shall be determined irrespective of any provisions as to a right of appeal from the decision of such Court. Explanation III. The matter above referred to must in the former suit have been alleged by one party and either denied or admitted, expressly or impliedly, by the other. Explanation IV. Any matter which might and ought to have been made ground of defence or attack in such former suit shall be deemed to have been a matter directly and substantially in issue in such suit. Explanation V. Any relief claimed in the plaint, which is not expressly granted by the decree, shall, for the purposes of this section, be deemed to have been refused. Explanation VI. Where persons litigate bona fide in respect of a public right or of a private right claimed in common for themselves and others, all persons interested in such right shall, for the purposes of this section, be deemed to claim under the persons so litigating.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "12",
        "Title": "Bar to further suit.",
        "Content": "(1)] Where a plaintiff is precluded by rules from instituting a further suit in respect of any particular cause of action, he shall not be entitled to institute a suit in respect of such cause of action in any Court to which this Code applies.",
        "": "[(2) Where a person challenges the validity of a judgment, decree or order on the plea of fraud, mis-representation or want of jurisdiction, he shall seek his remedy by making an application to the Court which passed the final judgment, decree or order and not by a separate suit.]"
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "13",
        "Title": "When foreign judgment not conclusive.",
        "Content": "A foreign judgment shall be conclusive as to any matter thereby directly adjudicated upon between the same parties or between parties under whom they or any of them claim litigating under the same title except (a) Where it has not been pronounced by a Court of competent Jurisdiction ; (b) Where it has not been given on the merits of the case; (c) Where it appears on the face of the proceedings to be founded on an incorrect view of international law or a refusal to recognise the law of 2[Pakistan] in cases in which such law is applicable; (d) Where the proceedings in which the Judgment was obtained are opposed to natural justice ; (e) Where it has been obtained by fraud ; (f) Where it sustains a claim founded on a breach of any law in force in 2[Pakistan].",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "14",
        "Title": "Presumption as to foreign judgment.",
        "Content": "The Court shall presume, upon the production of any document purporting to be a certified copy of a foreign Judgment, that such Judgment was pronounced by a Court of competent Jurisdiction, unless the contrary appears on the record ; but such presumption may be displaced by proving want of jurisdiction. PLACE OF SUING",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "15",
        "Title": "Court in which suits to be instituted.",
        "Content": "Every suit shall be instituted in the Court of the lowest grade competent to try it.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "16",
        "Title": "Suits to be instituted where subject-matter situate.",
        "Content": "Subject to the pecuniary or other limitations prescribed by any law, suits (a) for the recovery of immoveable property with or without rent or profits, (b) for the partition of Immoveable property, (c) for foreclosure, sale or redemption in the case of a mortgage of or charge upon immoveable property, (d) for the determination of any other right to or interest in immoveable property, (e) for compensation for wrong to immoveable property, (f) for the recovery of moveable property actually under distraint or attachment, 1Sub-section (2) added by the Code of Civil Procedure (Amdt.) Ordinance, No. X of 1980, s.2. 2Subs. by the Central Laws (statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. ( with effect from the 14th October, 1955 ).",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "17",
        "Title": "Suits for immoveable property situate within jurisdiction of different Courts.",
        "Content": "Where a suit is to obtain relief respecting, or compensation for wrong to, immoveable property situate with in the jurisdiction of different Courts, the suit may be instituted in any Court within the local limits of whose jurisdiction any portion of the property is situate: Provided that, in respect of the value of the subject-matter of the suit, the entire claim is cognizable by such Court.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "18",
        "Title": "Place of institution of suit where local limits of jurisdiction, of Courts are uncertain.",
        "Content": "(1) Where it is alleged to be uncertain within the local limits of the jurisdiction of which of two or more Courts any immoveable property is situate, any one of those Courts may, if satisfied that there is ground for the alleged uncertainty, record a statement to that effect and thereupon proceed to entertain and dispose of any suit relating to that property, and its decree in the suit shall have the same effect as if the property were situate within the local limits of its Jurisdiction : Provided that the suit is one with respect to which the Court is competent as regards the nature and value of the suit to exercise Jurisdiction. (2) Where a statement has not been recorded under subs-section (1), and an objection is taken before an appellate or revisional Court that a decree or order in a suit relating to such property was made by a Court not having jurisdiction where the property is situate, the appellate or revisional Court shall not allow the objection unless in its opinion there was, at the time of the institution of the suit, no reasonable ground for uncertainty as to the Court having jurisdiction with respect thereto and there has been a consequent failure of Justice.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "19",
        "Title": "Suits for compensation for wrongs to person or moveables.",
        "Content": "Where a suit is for compensation for wrong done to the person or to moveable property, if the wrong was done within the local limits of the Jurisdiction of one Court and the defendant resides, or carries on business, or personally works for gain, within the local limits of the Jurisdiction of another Court, the suit may be instituted at the option of the plaintiff in either of the said Courts. 1Ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. XLIV of 1962, s.6. 2Subs. by the Central Laws (Statute Reform) ordinance, No. XXI of 1960, s.3 and 2nd Sch. ( with effect from the 14th October, 1955 ).",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "20",
        "Title": "Other suits to be instituted where defendants reside or cause of action arises.",
        "Content": "Subject to the limitations aforesaid, every suit shall be instituted in a Court within the local limits of whose jurisdiction (a) the defendant, or each of the defendants where there are more than one, at the time of the commencement of the suit, actually and voluntarily resides, or carries on business, or personally works for gain ; or (b) any of the defendants, where there are more than one, at the time of the commencement of the suit, actually and voluntarily resides, or carries on business, or personally works for gain, provided that in such case either the leave of the Court is given, or the defendants who do not reside, or carryon business, or personally work for gain, as aforesaid, acquiesce in such institution ; or (c) the cause of action, wholly or in part, arises. Explanation I. Where a person has permanent dwelling at one place and also a temporary residence at another place, he shall be deemed to reside at both places in respect of any cause of action arising at the place where he has such temporary residence. Explanation II. A corporation shall be deemed to carry on business at its sole or principal office in 1[Pakistan] or, in respect of any cause of action arising at any place where it has also a subordinate office, at such place. Illustrations (a) A is a tradesman in 2[Lahore]. B carries on business in 1[Karachi], B, by his agent in 2[Lahore], buys goods of A and requests A to deliver them to the 1[Pakistan International Airways]. A delivers the goods accordingly in 2[Lahore]. A may sue B for the price of the goods either in 2[Lahore] where the cause of action has arisen, or in 1[Karachi], where B carries on business. (b) A resides at 1[Murree], B at 2[Lahore], and C at 1[Karachi], A, B and C being together at 1[Bahawalpur], B and C make a joint promissory note payable on demand, and deliver it to A. A may sue B and C 1[Bahawalpur,] where the cause of action arose. He may also sue them at 2[Lahore], where B resides, or at 1[Karachi], 1Subs. by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. ( with effect from the 14th October, 1955 ). 2Subs. by the Federal Laws (Revision and Declaration) Ordinance, No. XXVII of 1981, s.3 and 2nd Sch.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "21",
        "Title": "Objections to jurisdiction.",
        "Content": "No objection as to the place of suing shall be allowed by any appellate or revisional Court unless such objection was taken in the Court of first instance at the earliest possible opportunity and in all cases where issues are settled at or before such settlement, and unless there has been a consequent failure of justice.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "22",
        "Title": "Power to transfer suits which may be instituted in more than one Court.",
        "Content": "Where a suit may be instituted in any one of two or more Courts and is instituted in one of such Courts, any defendant, after notice to the other parties, may, at the earliest possible opportunity and in all cases where issues are settled at or before such settlement, apply to have the suit transferred to another Court, and the Court to which such application is made, after considering the objections of the other parties (if any), shall determine in which of the several Courts having jurisdiction the suit shall proceed.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "23",
        "Title": "To what Court application lies.",
        "Content": "(1) Where the several Courts having jurisdiction are subordinate to the same Appellate Court, an application under section 22 shall be made to the Appellate Court. (2) Where such Courts are subordinate to different appellate Courts but to the same High Court, the application shall be made to the said High Court. (3) Where such Courts are subordinate to different High Courts, the application shall be made to the High Court within the local limits of whose jurisdiction the Court in which the suit is brought is situate.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "24",
        "Title": "General power of transfer and with drawl.",
        "Content": "(1) On the application of any of the parties and after notice to the parties and after hearing such of them as desire to be heard, or of its own motion without such notice, the High Court or the District Court may at any stage (a) transfer any suit, appeal or other proceeding pending before it for trial or disposal to any Court subordinate to it and competent to try or dispose of the same, or (b) withdraw any suit, appeal or other proceeding pending in any Court subordinate to it, and (i) try or dispose of the same ; or (ii) transfer the same for trial or disposal to any Court subordinate to it and competent to try or dispose of the same ; or (iii) retransfer the same for trial or disposal to the Court from which it was withdrawn. (2) Where any suit or proceeding has been transferred or withdrawn under sub-section (1), the Court which thereafter tries such suit may, subject to any special directions in the case of an order of transfer, either retry it or proceed from the point at which it was transferred or withdrawn. (3) For the purposes of this section, Courts of Additional and Assistant Judges shall be deemed to subordinate to the District Court. (4) The Court trying any suit transferred or withdrawn under this section from a Court of Small Causes shall, for the purposes of such suit, be deemed to be a Court of Small Causes. 1[24A. Appreance of parties on transfer of suits, etc. (1) Where any suit is transferred under section 22, or any suit, appeal or other proceeding is transferred or withdrawn under sub-section (1) of section 24 on the application of a party, the Court ordering the transfer or withdrawal shall fix a date for the appearance of the parties before itself, if the suit, appeal or other proceeding is to be tried or disposed of by itself, or before the Court to which the case is so transferred. 1S.24A ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. XLIV of 1962, s.7.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "26",
        "Title": "Institution of suit.",
        "Content": "Every suit shall be instituted by presentation of a plaint or in such other manner as may be prescribed.] 2[26A-26D. * * * * * * *] SUMMONS AND DISCOVERY",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "27",
        "Title": "Summons to defendants.",
        "Content": "Where a suit has been duly instituted, a summons may be issued to the defendant to appear and answer the claim 2[* * *] and may be served in manner prescribed. 2[27A. * * * * * * *]",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "28",
        "Title": "Service of summons where defendant resides in another Province.",
        "Content": "(1) A Summons may be sent for service in another Province to such Court and in such manner as may be prescribed by rules in force in that Province. (2) The Court to which such summons is sent shall, upon receipt thereof, proceed as if it had been issued by such Court and shall then return the summons to the Court of issue together with the record (if any) of its proceedings with regard thereto.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "29",
        "Title": "Service of foreign summonses.",
        "Content": "Summonses 2 [and other processes] issued by any Civil",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "30",
        "Title": "Power to order discovery and the like.",
        "Content": "Subject to such conditions and limitations as may be prescribed, the Court may, at any time, either of its own motion or on the application of any party, (a) make such orders as may be necessary or reasonable in all matters relating to the delivery and answering of interrogatories, the admission of documents and facts, and the discovery, inspection, production, impounding and return of documents or other material objects producible as evidence ; (b) issue summonses to persons whose attendance is required either to give evidence or to produce documents or such other objects as aforesaid ; (c) order any fact to be proved by affidavit.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "31",
        "Title": "Summons to witness.",
        "Content": "The provisions in sections 27, 28 and 29 shall apply to summonses to give evidence or to produce documents or other material objects.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "32",
        "Title": "Penalty for default.",
        "Content": "The Court may compel the attendance of any person to whom a summons has been issued under section 30 and for that purpose may (a) issue a warrant for his arrest ; (b) attach and sell his property ; (c) impose a fine upon him not exceeding 10[two thousand] rupees ; (d) order him to furnish security for his appearance and in default commit him to 10[* * *] prison. JUDGMENT AND DECREE",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "33",
        "Title": "Judgment and decree.",
        "Content": "The Court, after the case has been heard, shall pronounce judgment, and on such judgment 11[* * *] a decree shall follow. 1Subs. by the Adaptation of Central Acts and Ordinances Order, 1949 (Order No. 4 of 1949) Art. 3 and Sch. 2Subs. by the Central Laws (Statute Reform) Ordinance, No. XXI of 1960, s.3 and 2nd Sch. ( w. e. f the 14th October, 1955 ). 3Subs. by the Code of Civil Procedure (Amdt.) Act No. XXXIV of 1940, s. 2(1) (a) (ii). 4Subs. by Adaptation Order,",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "34",
        "Title": "Interest.",
        "Content": "(1) Where and in so far as a decree is for the payment of money, the Court may, in the decree, order interest at such rate as the Court deems reasonable to be paid on the principal sum adjudged, from the date of the suit to the date of the decree, in addition to any interest adjudged on such principal sum for any period prior to the institution of the suit, with further interest at such rate as the Court deems reasonable on the aggregate sum so adjudged, from the date of the decree to the date of payment, or to such earlier date as the Court thinks fit. (2) Where such a decree is silent with respect to the payment of further interest on such aggregate sum as aforesaid from the date of the decree to the date of payment or other earlier date, the Court shall be deemed to have refused such interest, and a separate suit therefore shall not lie. 1[34A. Interest on public dues. (1) Where the Court is of opinion that a suit was instituted with intent to avoid the payment of any public dues payable by the plaintiff or on his behalf, the Court may, while dismissing such suit, make an order for payment of interest on such public dues at the rate of two per cent, above the prevailing bank rate. (2) Where the court is of opinion that the recovery of any public dues from the plaintiff was unjustified, the Court may, while disposing of the suit, make an order for payment of interest on the amount recovered at the rate of two per cent, above the prevailing bank rate. Explanation . In this section, (a) “bank rate” means the bank rate determined and made public under the provisions of the State Bank of Pakistan Act, 1956 (XXXIII of 1956) ; and (b) “public dues” includes the dues of any bank owned by the Federal Government or of any corporation or undertaking owned or controlled by the Federal Government or a Provincial Government or of any local authority.] 2[34B. Interest, etc. on dues of banking company. Where and in so far as a decree is for payment of money due to a banking company in repayment of a loan advanced by it, the Court shall, in the decree, provide for interest or return, as the case may be, on the judgment debt from the date of decree till payment (a) in the case of interest-bearing loans, for interest at the contracted rate or at the rate of two per cent above the bank rate, whichever is the higher ; (b) in the case of loans given on the basis of mark-up in price, lease, hire-purchase or service charges, for the contracted rate of mark-up, rental, hire or service charges, as the case may be, or at the latest rate of the banking company for similar loans, whichever is the higher ; and (c) in the case of loans given on the basis of participation in profit and loss, for return at such rate, not being less than the annual rate of profit for the preceding six months paid by the banking company on term deposits of six months accepted by it on the basis of participation in profit and loss, as the court may consider just and reasonable in the circumstances of the case, keeping in view 1New section 34A was ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. X of 1980) s.3. 2Section 34B ins. by the Code of Civil Procedure (Amdt.) Ordinance, No. LXIII of 1980, s.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "35",
        "Title": "Costs.",
        "Content": "(1) Subject to such conditions and limitations, as may be prescribed, and to the provisions of any law for the time being in force, (i) a party to any proceedings shall, before the announcement of final order, judgment or decree, file in the prescribed form, detail of actual costs of litigation, including but not limited to court fee, stamp fee, fee paid to counsel and all other ancillary or incidental expenses thereto; (ii) the Court shall award the actual costs of litigation under clause (i) to the successful party with markup not exceeding the prescribed limit per annum, as notified by the State Bank of Pakistan, at the time of passing the order, judgement or decree; (iii) the costs other than those mentioned in clause (i) shall be in the discretion of the Court; and (iv) the Court shall have full power to determine out of what property such costs are to be paid and recovered and to give all necessary directions for the purpose aforesaid. (2) The fact the Court has no jurisdiction in respect of the proceedings shall be no bar to the exercise of such powers under this section. 35A. Adjournment costs. If, on the date fixed for hearing in any proceedings, a party to the proceedings or any other person, despite service of notice, fails to appear or comply with any order of the Court or mandatory provision of the Code or any other law for the time being in force, seeks an adjournment for such purpose, the Court shall, for sufficient cause and reasons to be recovered, grant such adjournment on the condition that such party or person shall pay to the other party, costs of adjournment which shall not be less than five thousand Rupees per adjournment or such higher amount as may be prescribed from time to time: Provided that if the Court is satisfied that the adjournment being sought is on account of unavoidable reasons beyond the control of the party concerned, which reasons shall be recorded by the Court, the Court may grant adjournment without imposing adjournment cost: Provided further that if the Court finds that there is a tendency of seeking repeated adjournments by any party on such grounds, the Court may not grant adjournment without imposing the adjournment costs as the Court may deem fit. 35B. Special costs. (1) If in any proceedings, the Court finds that any averment made by any party is false or vexatious to the knowledge of such party, the Court shall award special costs to the opposite party against whom such averment has been made. 1Subs. by Act No. XVII of 2017, s.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "36",
        "Title": "Application to orders.",
        "Content": "The provisions of this Code relating to the execution of decrees shall, so far as they are applicable, be deemed to apply to the execution of orders.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "37",
        "Title": "Definition of Court which passed a decree.",
        "Content": "The expression “Court which passed a decree,” or words to that effect, shall, in relation to the execution of decrees, unless there is anything repugnant in the subject or context, be deemed to include, (a) where the decree to be executed has been passed in the exercise of appellate jurisdiction, the Court of first instance, and (b) where the Court of first instance has ceased to exist or to have jurisdiction to execute it, the Court which, if the suit wherein the decree was passed was instituted at the time of making the application for the execution of the decree, would have Jurisdiction to try such suit. COURTS BY WHICH DECREES MAY BE EXECUTED",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "38",
        "Title": "Court by which decree may be executed.",
        "Content": "A decree may be executed either by the Court which passed it, or by the Court to which it is sent for execution.",
        "": ""
    },
    {
        "Part Number": "1",
        "Part Name": "SUITS IN GENERAL JURISDICTION OF THE COURTS AND Res Judicata",
        "Rule Number": "39",
        "Title": "Transfer of decree.",
        "Content": "(1) The Court which passed a decree may, on the application of the decree-holder, send it for execution to another Court, (a) if the person against whom the decree is passed actually and voluntarily resides or carries on business, or personally works for gain, within the local limits of the jurisdiction of such other Court, or (b) if such person has not property within the local limits of the jurisdiction of the Court which passed the decree sufficient to satisfy such decree and has property within the local limits of the jurisdiction of such other Court, or (c) if the decree directs the sale or delivery of immoveable property situate outside the local limits of the Jurisdiction of the Court which passed it, or (d) if the Court which passed the decree considers for any other reason, which it shall record in writing, that the decree should be executed by such other Court.",
        "": ""
    }
]