[
    {
        "Part Number": "8",
        "Part Name": "REFERENCE, REVIEW AND REVISION",
        "Rule Number": "113",
        "Title": "Reference to High Court",
        "Content": ". Subject to such conditions and limitations as may be prescribed, any Court may state a case and refer the same for the opinion of the High Court, and the High Court may make such order thereon as it thinks fit."
    },
    {
        "Part Number": "8",
        "Part Name": "REFERENCE, REVIEW AND REVISION",
        "Rule Number": "114",
        "Title": "Review.__",
        "Content": "(1) Subject as aforesaid, any person considering himself aggrieved by a degree or order from which__ (a) an appeal is allowed by this Code, but from which no appeal has been preferred; or (b) no appeal is allowed by this Code, may apply for a review of judgment to the Court which passed the degree or made the order, and the Court may make such order thereon as it think fit.]"
    },
    {
        "Part Number": "8",
        "Part Name": "REFERENCE, REVIEW AND REVISION",
        "Rule Number": "115",
        "Title": "Revision.__",
        "Content": "(1) A High Court may call for the record of any case which has been decided by any Court subordinate to that High Court and in which no appeal lies thereto, and if such subordinate Court appears__ (a) to have exercised a jurisdiction not vested in it by law; or (b) to have failed to exercise a jurisdiction so vested; or (c) to have acted in the exercise of its jurisdiction illegally or with material irregularity, the High Court may make such order in the case as it thinks fit: Provided that where a person makes an application under this sub section, he shall, in support of such application, furnish copies of the pleadings, documents and order of the subordinate Court and the High Court shall, except for reasons to be recorded, dispose of such application without calling for the record of the subordinate Court: Provided further that such application shall be made within ninety days of the decision of the subordinate Court which shall provide a copy of such decision within three days thereof and the High Court shall dispose of such application within six months. (2) A District Court may exercise the powers conferred on the High Court by sub section (1) in respect of any case decided by a Court subordinate to that District Court in which no appeal lies and the amount or value of the subject matter whereof does not exceed the limits of the appellate jurisdiction of the District Court. (3) If an application under sub section (1) in respect of a case within the competence of the District Court has been made either to the High Court or the District Court, no further such application shall be made to either of them. (4) No proceedings in revision shall be entertained by the High Court against an order made under sub section (2) by the District Court.] PART VIII REFERENCE, REVIEW AND REVISION"
    }
]