{
  "part": "E",
  "title": "LEGISLATION",
  "rules": [
    {
      "number": "48",
      "title": "Directions to the Governors",
      "content": "No Division shall issue a directive to the Governor of a Province under clause (1) of Article 145 without the specific approval of the Prime Minister."
    },
    {
      "number": "49",
      "title": "Obligations of Provinces and Federation",
      "content": "(1) Omitted vide S.R.O 368(I)/2010 (F.No.4-6/2010-Min-I) dated 1st June 2010.\n(2) Omitted vide S.R.O 368(I)/2010 (F.No.4-6/2010-Min-I) dated 1st June 2010.\n(3) The implementation of an international agreement in the Provincial field shall normally be the responsibility of the Provincial Government unless specific orders of the Prime Minister are obtained by the concerned Division in accordance with rule 15(1)(c).\n(4) The Foreign Affairs Division shall issue necessary instructions to the Provincial Governments regarding correspondence with foreign governments, Pakistan Diplomatic Missions, Foreign Missions in Pakistan, or International Organizations."
    },
    {
      "number": "50",
      "title": "Conferment of Powers and Imposition of Duties upon a Province",
      "content": "The concerned Division must obtain specific orders of the Prime Minister if it is proposed to enact a law that confers powers or imposes duties upon a Province, its officers, or authorities, under clause (2) of Article 146."
    },
    {
      "number": "50A",
      "title": "Secretariat of Council of Common Interests",
      "content": "(1) A Secretariat of the Council of Common Interests (SCCI) shall exist with the status of a Division, headed by the Secretary to the Council of Common Interests.\n(2) The Secretary shall report directly to the Prime Minister in his capacity as Chairman of the CCI and shall function as the principal accounting officer of the Secretariat.\n(3) The business of the Council shall be governed by the Rules of Procedure of the Council of Common Interests, 2010."
    }
  ]
}