{
  "part": "F",
  "title": "MISCELLANEOUS",
  "rules": [
    {
      "number": "55",
      "title": "Protection and Communication of Official Information",
      "content": "(1) Information acquired from official documents relating to official matters shall only be communicated by a government servant or designated official to the press, to non-officials, or even to officials of other government offices in accordance with the procedure in section 3 of the Freedom of Information Ordinance, 2002 (XCVI of 2002).\n(2) The Cabinet Division shall issue detailed instructions for the treatment and custody of official documents and classified information.\n(3) All official news and information shall ordinarily be conveyed to the press and public through the Press Information Department or the External Publicity Wing of the Information and Broadcasting Division. The manner shall be prescribed by general or special orders issued by the Information and Broadcasting Division.\n(4) Only Ministers, Secretaries, or authorized officers may act as official spokesmen of the Government. No statement involving foreign policy shall normally be made by any person (other than the Minister of State for Foreign Affairs and the Prime Minister) without prior consultation with the Foreign Affairs Division."
    },
    {
      "number": "56",
      "title": "Channels of Communication",
      "content": "(1) Except as provided in sub-rule (2), all correspondence with foreign governments, Pakistan diplomatic missions abroad, foreign missions in Pakistan, or international organizations shall normally be conducted through the Foreign Affairs Division. Direct correspondence may be allowed under conditions specified by general or special orders from the Foreign Affairs Division.\n(2) Requests for economic or technical assistance from foreign governments or international organizations shall be made through the Economic Affairs Division, which shall follow prescribed channels. The Division may allow direct requests through general or special orders.\n(3) Correspondence with Provincial Governments shall be conducted directly by the relevant Division on allocated subjects, and shall ordinarily be addressed to the Secretary of the relevant Department in the Provincial Government. Attached Departments may be authorized to correspond directly under conditions specified by general or special orders.\n(4) Copies of correspondence with Provincial Governments concerning affairs of former and acceding states shall be endorsed to the States and Frontier Regions Division, unless otherwise directed by general or special orders.\n(5) Correspondence with the headquarters of the Defence Forces (GHQ, Naval HQ, Air HQ, or subordinate formations) shall normally be conducted through the Defence Division. Direct correspondence may be permitted under specific conditions. This does not affect normal communication between Service Commanders and Civil Authorities in their areas or inter-departmental discussions involving Service representatives."
    },
    {
      "number": "57",
      "title": "Relaxation",
      "content": "The Prime Minister may permit relaxation of the provisions of these rules in individual cases where deemed necessary."
    },
    {
      "number": "58",
      "title": "Repeal",
      "content": "The Rules of Business, 1962 are hereby repealed. However, all rules, instructions, and orders issued under those Rules shall remain in force, with necessary adaptations, until altered, repealed, or amended by the appropriate authority."
    }
  ]
}
