[
  {
    "part": "I",
    "title": "LIST OF MINISTRIES AND DIVISIONS",
    "rules": [
      {
        "number": "1",
        "title": "Cabinet Division",
        "content": "Cabinet Division handles Cabinet affairs, formulation and maintenance of Rules of Business, coordination of inter-ministerial activities, and committee oversight."
      },
      {
        "number": "2",
        "title": "Ministry of Finance",
        "content": "Ministry of Finance includes Finance Division (manages federal budget, fiscal policy, loans) and Revenue Division (oversees taxation, Federal Board of Revenue)."
      },
      {
        "number": "3",
        "title": "Ministry of Law and Justice",
        "content": "Ministry of Law and Justice comprises Law and Justice Division, responsible for drafting legislation, providing legal advice, and handling constitutional matters."
      }
    ]
  },
  {
    "part": "II",
    "title": "DISTRIBUTION OF BUSINESS AMONG DIVISIONS",
    "rules": [
      {
        "number": "1",
        "title": "Cabinet Division Functions",
        "content": "Formulation and updating of Rules of Business, coordination of Cabinet meetings, oversight of committees, and inter-Division coordination."
      },
      {
        "number": "2",
        "title": "Finance Division Functions",
        "content": "Preparation of federal budget, control of public expenditure, economic policy advice, and management of loans and grants."
      },
      {
        "number": "3",
        "title": "Law and Justice Division Functions",
        "content": "Drafting of bills and ordinances, providing legal opinions to Divisions, advising on constitutional and international legal matters."
      }
    ]
  },
  {
    "part": "III",
    "title": "CASES TO BE SUBMITTED TO THE PRIME MINISTER FOR ORDERS",
    "rules": [
      {
        "number": "1",
        "title": "Senior Appointments",
        "content": "Cases involving appointments of Secretaries, Grade 22 officers, and heads of autonomous bodies, requiring Prime Minister’s approval."
      },
      {
        "number": "2",
        "title": "Major Policy Decisions",
        "content": "Proposals for major policies affecting national security, economy, or foreign relations, submitted to the Prime Minister for orders."
      },
      {
        "number": "3",
        "title": "International Agreements",
        "content": "Signing or ratification of international treaties and agreements, subject to prior Cabinet approval, requiring Prime Minister’s orders."
      }
    ]
  }
]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  